[
  {
    "id": 1,
    "name": "You Don't Know JS Yet: Get Started",
    "author": "Kyle Simpson,",
    "price": 2215,
    "discount": 0,
    "category": "programming",
    "isbn": "B084BNMN7T",
    "pages": 128,
    "published": "January, 2020",
    "publisher": "Learnpub",
    "rating": 4.41,
    "cover": "images/1.jpg",
    "edition": "1st Edition",
    "description": "It seems like there's never been as much widespread desire before to learn JS. But with a million blogs, books, and videos out there, just where do you start? The worldwide best selling \"You Don't Know JS\" book series is back for a 2nd edition: \"You Don't Know JS Yet\". All 6 books are brand new, rewritten to cover all sides of JS for 2020 and beyond."
  },
  {
    "id": 2,
    "name": "Graph Algorithm",
    "author": "Safayet Ashraf",
    "price": 235,
    "discount": 0.15,
    "category": "programming",
    "isbn": "9789849216",
    "pages": 124,
    "published": "September, 2016",
    "publisher": "Dimik Prokashoni",
    "rating": 4.55,
    "cover": "images/2.jpg",
    "edition": "1st Edition",
    "description": "শুধুমাত্র গ্রাফ অ্যালগরিদম নিয়ে লেখা বাংলা ভাষায় প্রথম বই এটি। সবেমাত্র গ্রাফ থিওরি শেখা শুরু করেছে বা করতে চায় তাদের কথা চিন্তা করে বইটি লেখা হয়েছে। বইটিতে ১৪টি অধ্যায় আছে।"
  },
  {
    "id": 3,
    "name": "The Algorithm Design Manual",
    "author": "Steven S. Skiena ",
    "price": 8478,
    "discount": 0.27,
    "category": "programming",
    "isbn": "3030542556",
    "pages": 810,
    "published": "October, 2020",
    "publisher": "Springer",
    "rating": 4.35,
    "cover": "images/3.jpg",
    "edition": "2nd Edition",
    "description": "This volume helps take some of the \"mystery\" out of identifying and dealing with key algorithms. Drawing heavily on the author's own real-world experiences, the book stresses design and analysis. Coverage is divided into two parts, the first being a general guide to techniques for the design and analysis of computer algorithms. The second is a reference section, which includes a catalog of the 75 most important algorithmic problems. By browsing this catalog, readers can quickly identify what the problem they have encountered is called, what is known about it, and how they should proceed if they need to solve it. This book is ideal for the working professional who uses algorithms on a daily basis and has need for a handy reference. This work can also readily be used in an upper-division course or as a student reference guide. THE ALGORITHM DESIGN MANUAL comes with a CD-ROM that contains: * a complete hypertext version of the full printed book. * the source code and URLs for all cited implementations. * over 30 hours of audio lectures on the design and analysis of algorithms are provided, all keyed to on-line lecture notes."
  },
  {
    "id": 4,
    "name": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "price": 898,
    "discount": 0,
    "category": "nonfiction",
    "isbn": "9780062316097",
    "pages": 464,
    "published": "January, 2015",
    "publisher": "Harpercollins Publishers",
    "rating": 4.4,
    "cover": "images/4.jpg",
    "edition": "1st Edition",
    "description": "100,000 years ago, at least six human species inhabited the earth. Today there is just one. Us. Homo sapiens."
  },
  {
    "id": 5,
    "name": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "price": 718,
    "discount": 0,
    "category": "fiction",
    "isbn": "0099549484",
    "pages": 309,
    "published": "January, 2010",
    "publisher": "Arrow Books",
    "rating": 4.28,
    "cover": "images/5.jpg",
    "edition": "50th Edition",
    "description": "A lawyer's advice to his children as he defends the real mockingbird of Harper Lee's classic novel - a black man charged with the rape of a white girl. Through the young eyes of Scout and Jem Finch, Harper Lee explores the irrationality of adult attitudes to race and class in the Deep South of the thirties. The conscience of a town steeped in prejudice, violence and hypocrisy is pricked by the stamina of one man's struggle for justice. But the weight of history will only tolerate so much"
  },
  {
    "id": 6,
    "name": "Les Miserable",
    "author": "Victor Hugo",
    "price": 1798,
    "discount": 0.12,
    "category": "novel",
    "isbn": "9780140444308",
    "pages": 1232,
    "published": "February, 1982",
    "publisher": "Penguin Classics",
    "rating": 4.18,
    "cover": "images/6.jpg",
    "edition": "1st Edition",
    "description": "Victor Hugo's tale of injustice, heroism and love follows the fortunes of Jean Valjean, an escaped convict determined to put his criminal past behind him. But his attempts to become a respected member of the community are constantly put under threat: by his own conscience, when, owing to a case of mistaken identity, another man is arrested in his place; and by the relentless investigations of the dogged Inspector Javert. It is not simply for himself that Valjean must stay free, however, for he has sworn to protect the baby daughter of Fantine, driven to prostitution by poverty."
  }
]
